// Напишите программу, которая принимает
// на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

// 1.Считать от пользователя N
// 2.Cоздать массив
// 3.Метод получения кубов
// 4.Распечатать результат
// 5.Распечатать красиво



// 1.Считать от пользователя N
int GetNumberByUser(string text)
{
  Console.Write(text + ":");
  return Convert.ToInt32;
}
